test/fixtures/files/webhook_status_not_changed.json

{
  "id": "evt_1E013BHlQ4lxw7FZp3YwKfNs",
  "object": "event",
  "api_version": "2018-11-08",
  "created": 1549264311,
  "data": {
    "object": {
      "id": "sub_ESwwZke6o4eyZA",
      "object": "subscription",
      "application_fee_percent": null,
      "billing": "charge_automatically",
      "billing_cycle_anchor": 1549262124,
      "billing_thresholds": null,
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "created": 1549262061,
      "current_period_end": 1551681324,
      "current_period_start": 1549262124,
      "customer": "cus_ESwwZc8qCe6a3B",
      "days_until_due": null,
      "default_source": null,
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_ESwwWm01RTuez6",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": 1549262062,
            "metadata": {
            },
            "plan": {
              "id": "plan_EQjv185SooNzUa",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 350,
              "billing_scheme": "per_unit",
              "created": 1548752380,
              "currency": "jpy",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "nickname": "ブンゴウメールPRO",
              "product": "prod_EQju7h2aOakmVF",
              "tiers": null,
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "quantity": 1,
            "subscription": "sub_ESwwZke6o4eyZA"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_ESwwZke6o4eyZA"
      },
      "livemode": false,
      "metadata": {
      },
      "plan": {
        "id": "plan_EQjv185SooNzUa",
        "object": "plan",
        "active": true,
        "aggregate_usage": null,
        "amount": 350,
        "billing_scheme": "per_unit",
        "created": 1548752380,
        "currency": "jpy",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {
        },
        "nickname": "ブンゴウメールPRO",
        "product": "prod_EQju7h2aOakmVF",
        "tiers": null,
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "schedule": null,
      "start": 1549262124,
      "status": "active",
      "tax_percent": null,
      "trial_end": 1549262123,
      "trial_start": 1549262061
    },
    "previous_attributes": {
      "billing_cycle_anchor": 1554390000,
      "current_period_end": 1551970799,
      "current_period_start": 1549262061,
      "start": 1549262061,
      "trial_end": 1551970799
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": "req_dd7VV6ITL1zGRS",
    "idempotency_key": null
  },
  "type": "customer.subscription.updated"
}
